[
  {
    "id": 1,
    "name": "Netfilms",
    "desc": "I built NetFilms using React and Next.js, creating a Netflix-like platform with a smooth and dynamic user experience. Movie data is fetched via an API, ensuring real-time updates and a rich content library. This project allowed me to enhance my front-end skills while working with API integration and modern web technologies",
    "img": "netfilms.jpg",
    "liveLink": "https://net-films-sigma.vercel.app/",
    "sourceLink": "https://github.com/Ayxan23/NetFilms.git"
  },
  {
    "id": 2,
    "name": "Blog",
    "desc": "I built this blog website using Next.js and React, focusing on clean and efficient design to enhance user experience. The platform dynamically fetches images via an API, ensuring a visually rich and engaging interface. My goal was to turn complex ideas into a seamless, user-friendly experience while continuously refining my skills with modern web technologies",
    "img": "blog.jpg",
    "liveLink": "https://blog-app-omega-jade.vercel.app/",
    "sourceLink": "https://github.com/Ayxan23/blog-app.git"
  },
  {
    "id": 3,
    "name": "Click Counter",
    "desc": "I developed a Mouse Click Counter game using HTML, CSS, and pure JavaScript, featuring 1, 5, 10, and 15-second timer options. Players click as fast as possible within the chosen time limit to earn a score. This project helped me improve my JavaScript skills while focusing on interactive and dynamic user experiences",
    "img": "click.jpg",
    "liveLink": "https://click-counter-sepia.vercel.app/",
    "sourceLink": "https://github.com/Ayxan23/JS-Click-Counter.git"
  },
  {
    "id": 4,
    "name": "Capital Shop",
    "desc": "I built Capital Shop using HTML, CSS, and pure JavaScript, creating a functional e-commerce site with local storage support. Users can add, remove, and filter products by category while their cart is saved for later. The site also includes login and signup features, enhancing both usability and interactivity",
    "img": "capital.jpg",
    "liveLink": "https://capital-shop-ten.vercel.app/",
    "sourceLink": "https://github.com/Ayxan23/capital-shop.git"
  },
  {
    "id": 5,
    "name": "Fylo",
    "desc": "I designed and developed the Fylo landing page using HTML and CSS, focusing on a clean and responsive layout. The goal was to create a visually appealing and user-friendly interface while ensuring smooth adaptability across different devices. This project helped me refine my front-end skills and attention to detail in web design",
    "img": "fylo.jpg",
    "liveLink": "https://fylo-landing-page-eight-sage.vercel.app/",
    "sourceLink": "https://github.com/Ayxan23/Fylo-Landing-Page.git"
  }
]
